&НаКлиенте
Функция ЗапросВЯндекс(Строка) Экспорт
времяДо = ТекущаяДата();
	
    // Получим код страницы https://ya.ru
    // Так как для доступа к ней используется защищенный
    // протокол https - нам нужно заполнить последний
    // параметр при соединении с сервером.
 
    Соединение = Новый HTTPСоединение(
        "ya.ru", // сервер (хост)
        443, // порт, по умолчанию для http используется 80, для https 443
        , // пользователь для доступа к серверу (если он есть)
        , // пароль для доступа к серверу (если он есть)
        , // здесь указывается прокси, если он есть
        , // таймаут в секундах, 0 или пусто - не устанавливать
       Новый ЗащищенноеСоединениеOpenSSL()
    );
 
    // Получаем текст корневой страницы через GET-запрос.
    Запрос = Новый HTTPЗапрос("/yandsearch?text=ыуф");
    // Если бы нужна была другая страница, мы бы указали,
    // например, "/about" или "/news".
 
    Результат = Соединение.Получить(Запрос);
    Сообщить(Результат.КодСостояния);
    Сообщить(Результат.ПолучитьТелоКакСтроку());  
	рез=Результат.ПолучитьТелоКакСтроку();
	Если Результат.КодСостояния = 302 Тогда 
 	URI = ОбработкаЗапроса.СтруктураURI(Результат.Заголовки.Получить("Location"));
 
 	Если URI.Схема = "https" Тогда
 //создадим новое, на этот раз безопасное, соединение
 	БезопасноеСоединение = Новый HTTPСоединение(URI.ИмяСервера,443,,,,,Новый ЗащищенноеСоединениеOpenSSL());
 //путь к ресурсу также возьмем из структуры URI
 	Ответ = БезопасноеСоединение.Получить(Новый HTTPЗапрос(URI.ПутьНаСервере));
 
 	Если Ответ.КодСостояния = 200 Тогда
 		Сообщить(Ответ.ПолучитьТелоКакСтроку());   
		рез=Ответ.ПолучитьТелоКакСтроку();
 	КонецЕсли;
 	КонецЕсли;
КонецЕсли;    

	ВремяПосле = ТекущаяДата();
	ВремяВыполнения = ВремяПосле - времяДо; 
	Сообщить(ВремяВыполнения);
	
КонецФункции

&НаКлиенте
Функция СтруктураURI(Знач СтрокаURI) Экспорт
 СтрокаURI = СокрЛП(СтрокаURI);
 
 Схема = "";
 Позиция = Найти(СтрокаURI, "://");
 Если Позиция > 0 Тогда
 Схема = НРег(Лев(СтрокаURI, Позиция - 1));
 СтрокаURI = Сред(СтрокаURI, Позиция + 3);
 КонецЕсли;
 
 СтрокаСоединения = СтрокаURI;
 ПутьНаСервере = "";
 Позиция = Найти(СтрокаСоединения, "/");
 Если Позиция > 0 Тогда
 ПутьНаСервере = Сред(СтрокаСоединения, Позиция + 1);
 СтрокаСоединения = Лев(СтрокаСоединения, Позиция - 1);
 КонецЕсли;
 
 СтрокаАвторизации = "";
 ИмяСервера = СтрокаСоединения;
 Позиция = Найти(СтрокаСоединения, "@");
 Если Позиция > 0 Тогда
 СтрокаАвторизации = Лев(СтрокаСоединения, Позиция - 1);
 ИмяСервера = Сред(СтрокаСоединения, Позиция + 1);
 КонецЕсли;
 
 Логин = СтрокаАвторизации;
 Пароль = "";
 Позиция = Найти(СтрокаАвторизации, ":");
 Если Позиция > 0 Тогда
 Логин = Лев(СтрокаАвторизации, Позиция - 1);
 Пароль = Сред(СтрокаАвторизации, Позиция + 1);
 КонецЕсли;
 
 Хост = ИмяСервера;
 Порт = "";
 Позиция = Найти(ИмяСервера, ":");
 Если Позиция > 0 Тогда
 Хост = Лев(ИмяСервера, Позиция - 1);
 Порт = Сред(ИмяСервера, Позиция + 1);
 КонецЕсли;
 
 Результат = Новый Структура;
 Результат.Вставить("Схема", Схема);
 Результат.Вставить("Логин", Логин);
 Результат.Вставить("Пароль", Пароль);
 Результат.Вставить("ИмяСервера", ИмяСервера);
 Результат.Вставить("Хост", Хост);
 Результат.Вставить("Порт", ?(Порт <> "", Число(Порт), Неопределено));
 Результат.Вставить("ПутьНаСервере", ПутьНаСервере);
 
 Возврат Результат;
КонецФункции