
&НаКлиенте
Процедура ОтправитьЗапрос(Команда)       
	
	времяДо = ТекущаяДата();
	
    // Получим код страницы https://ya.ru
    // Так как для доступа к ней используется защищенный
    // протокол https - нам нужно заполнить последний
    // параметр при соединении с сервером.
 
    Соединение = Новый HTTPСоединение(
        "ya.ru", // сервер (хост)
        443, // порт, по умолчанию для http используется 80, для https 443
        , // пользователь для доступа к серверу (если он есть)
        , // пароль для доступа к серверу (если он есть)
        , // здесь указывается прокси, если он есть
        , // таймаут в секундах, 0 или пусто - не устанавливать
       Новый ЗащищенноеСоединениеOpenSSL()
    );
 
    // Получаем текст корневой страницы через GET-запрос.
    Запрос = Новый HTTPЗапрос("/yandsearch?text=ыуф");
    // Если бы нужна была другая страница, мы бы указали,
    // например, "/about" или "/news".
 
    Результат = Соединение.Получить(Запрос);
    Сообщить(Результат.КодСостояния);
    Сообщить(Результат.ПолучитьТелоКакСтроку());  
	рез=Результат.ПолучитьТелоКакСтроку();
	Если Результат.КодСостояния = 302 Тогда 
 	URI = ОбработкаЗапроса.СтруктураURI(Результат.Заголовки.Получить("Location"));
 
 	Если URI.Схема = "https" Тогда
 //создадим новое, на этот раз безопасное, соединение
 	БезопасноеСоединение = Новый HTTPСоединение(URI.ИмяСервера,443,,,,,Новый ЗащищенноеСоединениеOpenSSL());
 //путь к ресурсу также возьмем из структуры URI
 	Ответ = БезопасноеСоединение.Получить(Новый HTTPЗапрос(URI.ПутьНаСервере));
 
 	Если Ответ.КодСостояния = 200 Тогда
 		Сообщить(Ответ.ПолучитьТелоКакСтроку());   
		рез=Ответ.ПолучитьТелоКакСтроку();
 	КонецЕсли;
 	КонецЕсли;
КонецЕсли;    

	ВремяПосле = ТекущаяДата();
	ВремяВыполнения = ВремяПосле - времяДо; 
	Сообщить(ВремяВыполнения);
КонецПроцедуры
