
&НаКлиенте
Процедура ОтправитьЗапрос(Команда) 
	
	 Соединение = Новый HTTPСоединение("n2yo.com",,,,,,Новый ЗащищенноеСоединениеOpenSSL());
 
 Запрос = Новый HTTPЗапрос("/satellites/?c=ALG&t=country");
 
 Ответ = Соединение.Получить(Запрос);
 
 Если Ответ.КодСостояния = 301 Тогда 
 URI = ОбработкаЗапроса.СтруктураURI(Ответ.Заголовки.Получить("Location"));
 
 Если URI.Схема = "https" Тогда
 //создадим новое, на этот раз безопасное, соединение
 БезопасноеСоединение = Новый HTTPСоединение("wiseadvice-it.ru",443,,,,,Новый ЗащищенноеСоединениеOpenSSL());
 //путь к ресурсу также возьмем из структуры URI
 Ответ = БезопасноеСоединение.Получить(Новый HTTPЗапрос(URI.ПутьНаСервере));
 
 Если Ответ.КодСостояния = 200 Тогда
 Сообщить(Ответ.ПолучитьТелоКакСтроку());
 КонецЕсли;
 КонецЕсли;
 КонецЕсли;
 Соединение = Новый HTTPСоединение("wiseadvice-it.ru");
 
 Запрос = Новый HTTPЗапрос("/o-kompanii/blog/articles/obshhie-moduli-v-1s-8-3/");
 
 Ответ = Соединение.Получить(Запрос);
 
 Если Ответ.КодСостояния = 301 Тогда            
	 НовыйАдрес = Ответ.Заголовки.Получить("Location");
	 URI = ОбработкаЗапроса.СтруктураURI(Ответ.Заголовки.Получить("Location"));
     Если URI.Схема = "https" Тогда
 //создадим новое, на этот раз безопасное, соединение
 БезопасноеСоединение = Новый HTTPСоединение("its.1c.ru",443,,,,,Новый ЗащищенноеСоединениеOpenSSL());
 //путь к ресурсу также возьмем из структуры URI
 Ответ = БезопасноеСоединение.Получить(Новый HTTPЗапрос(URI.ПутьНаСервере));    
 Сообщить(Ответ.КодСостояния);
   КонецЕсли;
 КонецЕсли;
 Если Ответ.КодСостояния = 200 Тогда
 Сообщить(Ответ.ПолучитьТелоКакСтроку());

КонецЕсли; 
Сообщить(Ответ.КодСостояния);
КонецПроцедуры
