
&НаКлиенте
Процедура ОтправитьЗапрос(Команда)       
	СтрукураОтвета = Сервер.ЗапросВЯндекс(ТекстЗапроса); 
	HtmlОтвет = СтрукураОтвета.ТекстОтвета;
	КодОтвета = СтрукураОтвета.КодСостояния;
	ВремяОтвета = СтрукураОтвета.Время;  
	Соединение = Новый HTTPСоединение(
        "localhost", // сервер (хост)
        80, // порт, по умолчанию для http используется 80, для https 443
        , // пользователь для доступа к серверу (если он есть)
        , // пароль для доступа к серверу (если он есть)
        , // здесь указывается прокси, если он есть
        , // таймаут в секундах, 0 или пусто - не устанавливать
       
    );   
	Заголовки = Новый Соответствие;
 	Заголовки.Вставить("User-Agent", "Mozilla/5.0 (X11; Linux i686; rv:2.0.1) Gecko/20100101 Firefox/4.0.1");
    Запрос = Новый HTTPЗапрос("/1cBaseTest/hs/ya/V1/aaa", Заголовки); 
    Результат = Соединение.Получить(Запрос);
КонецПроцедуры

