
&НаКлиенте
Процедура ОтправитьЗапрос(Команда) 
	
	 Соединение = Новый HTTPСоединение("n2yo.com",,,,,,Новый ЗащищенноеСоединениеOpenSSL());
 
 Запрос = Новый HTTPЗапрос("/satellites/?c=ALG&t=country");
 
 Ответ = Соединение.Получить(Запрос);
 
 Если Ответ.КодСостояния = 301 Тогда 
 URI = ОбработкаЗапроса.СтруктураURI(Ответ.Заголовки.Получить("Location"));
 
 Если URI.Схема = "https" Тогда
 //создадим новое, на этот раз безопасное, соединение
 БезопасноеСоединение = Новый HTTPСоединение("wiseadvice-it.ru",443,,,,,Новый ЗащищенноеСоединениеOpenSSL());
 //путь к ресурсу также возьмем из структуры URI
 Ответ = БезопасноеСоединение.Получить(Новый HTTPЗапрос(URI.ПутьНаСервере));
 
 Если Ответ.КодСостояния = 200 Тогда
 Сообщить(Ответ.ПолучитьТелоКакСтроку());
 КонецЕсли;
 КонецЕсли;
 КонецЕсли;
    // Получим код страницы https://ya.ru
    // Так как для доступа к ней используется защищенный
    // протокол https - нам нужно заполнить последний
    // параметр при соединении с сервером.
 
    Соединение = Новый HTTPСоединение(
        "ya.ru", // сервер (хост)
        443, // порт, по умолчанию для http используется 80, для https 443
        , // пользователь для доступа к серверу (если он есть)
        , // пароль для доступа к серверу (если он есть)
        , // здесь указывается прокси, если он есть
        , // таймаут в секундах, 0 или пусто - не устанавливать
       Новый ЗащищенноеСоединениеOpenSSL()
    );
 
    // Получаем текст корневой страницы через GET-запрос.
    Запрос = Новый HTTPЗапрос("/");
    // Если бы нужна была другая страница, мы бы указали,
    // например, "/about" или "/news".
 
    Результат = Соединение.Получить(Запрос);
    Сообщить(Результат.КодСостояния);
    Сообщить(Результат.ПолучитьТелоКакСтроку());
КонецПроцедуры
